In [3]:
#Data Cleaning and Preparation

import pandas as pd
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))

import numpy as np
np.random.seed(12345)
np.set_printoptions(precision=4, suppress=True)

In [4]:
#Handling Missing Data

string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [6]:
#Filtering Out Missing Data

from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
#or

data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
print(data)
cleaned = data.dropna()
print("\n\n",cleaned)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0


      0    1    2
0  1.0  6.5  3.0

In [9]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [10]:
data[4] = NA
print(data)
data.dropna(axis=1, how='all')

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
df = pd.DataFrame(np.random.randn(7, 3))
print(df)
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
#df.iloc[0,0] = NA
print(df)
print(df.dropna())
print(df.dropna(thresh=2))

          0         1         2
0 -0.204708  0.478943 -0.519439
1 -0.555730  1.965781  1.393406
2  0.092908  0.281746  0.769023
3  1.246435  1.007189 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741
          0         1         2
0 -0.204708       NaN       NaN
1 -0.555730       NaN       NaN
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741
          0         1         2
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741
          0         1         2
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [12]:
#Filling In Missing Data
#fill cols with all 0
df.fillna(0)

          0         1         2
0 -0.204708  0.000000  0.000000
1 -0.555730  0.000000  0.000000
2  0.092908  0.000000  0.769023
3  1.246435  0.000000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [13]:
#fill specific cols with specific values 
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.204708  0.500000  0.000000
1 -0.555730  0.500000  0.000000
2  0.092908  0.500000  0.769023
3  1.246435  0.500000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [14]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -0.204708  0.000000  0.000000
1 -0.555730  0.000000  0.000000
2  0.092908  0.000000  0.769023
3  1.246435  0.000000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [15]:
df = pd.DataFrame(np.random.randn(6, 3))
print(df)
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
print(df)
print(df.fillna(method='ffill'))
#ffill upto given limit
print(df.fillna(method='ffill', limit=2))

          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772  0.000940  1.343810
3 -0.713544 -0.831154 -2.370232
4 -1.860761 -0.860757  0.560145
5 -1.265934  0.119827 -1.063512
          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772       NaN  1.343810
3 -0.713544       NaN -2.370232
4 -1.860761       NaN       NaN
5 -1.265934       NaN       NaN
          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772  0.124121  1.343810
3 -0.713544  0.124121 -2.370232
4 -1.860761  0.124121 -2.370232
5 -1.265934  0.124121 -2.370232
          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772  0.124121  1.343810
3 -0.713544  0.124121 -2.370232
4 -1.860761       NaN -2.370232
5 -1.265934       NaN -2.370232

In [16]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [17]:
#Removing Duplicates

data = pd.DataFrame({'k1': ['two'] + ['one', 'two'] * 3 + ['two'], 'k2': [4, 1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  two   4
1  one   1
2  two   1
3  one   2
4  two   3
5  one   3
6  two   4
7  two   4

In [18]:
#first value is not marked as duplicate in default mode
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7     True
dtype: bool

In [19]:
data.drop_duplicates()

    k1  k2
0  two   4
1  one   1
2  two   1
3  one   2
4  two   3
5  one   3

In [20]:
data['v1'] = range(8)
print(data)

#check duplicates based on a particular col:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  two   4   0
1  one   1   1
2  two   1   2
3  one   2   3
4  two   3   4
5  one   3   5
6  two   4   6
7  two   4   7

    k1  k2  v1
0  two   4   0
1  one   1   1

In [21]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
1  one   1   1
2  two   1   2
3  one   2   3
4  two   3   4
5  one   3   5
7  two   4   7

In [22]:
#Transforming Data Using a Lambda Function

data = pd.DataFrame(
    {'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'],
     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [23]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [24]:
lowercased = data['food'].str.lower()
print(lowercased)
data['animal'] = lowercased.map(meat_to_animal)
print(data)

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object
          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [25]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [26]:
#Replacing Values inplace of missing values

data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [27]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [28]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [29]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [30]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [31]:
#Renaming Axis Indexes

data = pd.DataFrame(np.arange(12).reshape((3, 4)), 
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [32]:
trans = lambda x: x[:4].upper()
data.index.map(trans)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [33]:
data.index = data.index.map(trans)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [34]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [35]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [36]:
data.rename(index={'OHIO': 'INDIANA'}, columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [37]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [38]:
# binning or bucketizing for continuous variables

ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [39]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [44]:
print(cats.codes)
print(cats.categories)
print(pd.value_counts(cats))

[0 0 0 1 0 0 2 1 3 2 2 1]
IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')
(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [45]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [50]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
print(ages, "  ", bins, "\n", pd.cut(ages,bins).categories)
pd.cut(ages, bins, labels=group_names)

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]    [18, 25, 35, 60, 100]
 IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [53]:
data = np.random.rand(20)
print(data)
pd.cut(data, 4, precision=2)

[0.3361 0.8264 0.8981 0.0427 0.1958 0.2945 0.627  0.0862 0.1429 0.5158
 0.6893 0.8566 0.6474 0.5816 0.7111 0.2524 0.9002 0.4423 0.0205 0.9597]

[(0.26, 0.49], (0.72, 0.96], (0.72, 0.96], (0.02, 0.26], (0.02, 0.26], ..., (0.02, 0.26], (0.72, 0.96], (0.26, 0.49], (0.02, 0.26], (0.72, 0.96]]
Length: 20
Categories (4, interval[float64]): [(0.02, 0.26] < (0.26, 0.49] < (0.49, 0.72] < (0.72, 0.96]]

In [55]:
data = np.random.randn(1000) # Normally distributed
cats = pd.qcut(data, 4) # Cut into quartiles
print(cats)
pd.value_counts(cats)

[(-0.00705, 0.681], (0.681, 3.26], (-0.609, -0.00705], (0.681, 3.26], (0.681, 3.26], ..., (-0.00705, 0.681], (-3.746, -0.609], (-0.609, -0.00705], (-0.00705, 0.681], (0.681, 3.26]]
Length: 1000
Categories (4, interval[float64]): [(-3.746, -0.609] < (-0.609, -0.00705] < (-0.00705, 0.681] < (0.681, 3.26]]

(0.681, 3.26]         250
(-0.00705, 0.681]     250
(-0.609, -0.00705]    250
(-3.746, -0.609]      250
dtype: int64

In [56]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-0.00705, 1.316], (-0.00705, 1.316], (-1.299, -0.00705], (1.316, 3.26], (1.316, 3.26], ..., (-0.00705, 1.316], (-1.299, -0.00705], (-1.299, -0.00705], (-0.00705, 1.316], (-0.00705, 1.316]]
Length: 1000
Categories (4, interval[float64]): [(-3.746, -1.299] < (-1.299, -0.00705] < (-0.00705, 1.316] < (1.316, 3.26]]

In [60]:
#filter out the outliers

data = pd.DataFrame(np.random.randn(1000, 4))
print(data.shape)
print(data.head())
data.describe()

(1000, 4)
          0         1         2         3
0  1.175259 -0.218468 -1.062118  0.847436
1  1.018252  0.662528  0.221225 -1.878469
2 -1.060781  0.669718  0.805348 -0.247803
3  1.844281  2.067076  0.447351 -0.838369
4  0.999861  0.880438 -1.400894 -0.297389

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.013494    -0.010757     0.007774    -0.015252
std       0.992352     0.990488     1.017535     1.018016
min      -2.735845    -3.488399    -3.398512    -3.022557
25%      -0.710744    -0.656148    -0.653038    -0.684271
50%      -0.045252    -0.019286     0.022968    -0.016851
75%       0.684335     0.658114     0.670613     0.640770
max       2.960544     2.960854     2.848017     3.398428

In [62]:
col = data[2]
print(col)
col[np.abs(col) > 3]

0     -1.062118
1      0.221225
2      0.805348
3      0.447351
4     -1.400894
         ...
995   -1.994388
996   -0.950615
997    1.326739
998    0.722364
999    0.128863
Name: 2, Length: 1000, dtype: float64

808   -3.398512
820   -3.098856
Name: 2, dtype: float64

In [74]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
244 -0.522213  0.148179 -2.259163  3.398428
283  0.979397 -3.019368  0.089540 -0.244526
336 -0.794846 -3.283708 -0.227946 -1.051163
408  0.269342 -3.488399 -1.334832 -1.267835
529  0.130897 -2.273688 -0.365968 -3.022557
808 -1.209961  0.888574 -3.398512  0.561477
820 -0.685178  0.089936 -3.098856 -0.281689

In [78]:
print(np.sign(data) * 3)
data[np.abs(data) > 3] = np.sign(data) * 3 #np.sign: Returns an element-wise indication of the sign of a number.
print(data[(np.abs(data) == 3).any(1)])
data.describe()

       0    1    2    3
0    3.0 -3.0 -3.0  3.0
1    3.0  3.0  3.0 -3.0
2   -3.0  3.0  3.0 -3.0
3    3.0  3.0  3.0 -3.0
4    3.0  3.0 -3.0 -3.0
..   ...  ...  ...  ...
995 -3.0  3.0 -3.0  3.0
996  3.0  3.0 -3.0  3.0
997  3.0  3.0  3.0  3.0
998  3.0  3.0  3.0 -3.0
999 -3.0 -3.0  3.0 -3.0

[1000 rows x 4 columns]
            0         1         2         3
244 -0.522213  0.148179 -2.259163  3.000000
283  0.979397 -3.000000  0.089540 -0.244526
336 -0.794846 -3.000000 -0.227946 -1.051163
408  0.269342 -3.000000 -1.334832 -1.267835
529  0.130897 -2.273688 -0.365968 -3.000000
808 -1.209961  0.888574 -3.000000  0.561477
820 -0.685178  0.089936 -3.000000 -0.281689

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.013494    -0.009965     0.008271    -0.015628
std       0.992352     0.987932     1.015980     1.016689
min      -2.735845    -3.000000    -3.000000    -3.000000
25%      -0.710744    -0.656148    -0.653038    -0.684271
50%      -0.045252    -0.019286     0.022968    -0.016851
75%       0.684335     0.658114     0.670613     0.640770
max       2.960544     2.960854     2.848017     3.000000

In [79]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0 -1.0  1.0
1  1.0  1.0  1.0 -1.0
2 -1.0  1.0  1.0 -1.0
3  1.0  1.0  1.0 -1.0
4  1.0  1.0 -1.0 -1.0

In [81]:
#reshaping data
import numpy as np
import pandas as pd

pd.options.display.max_rows = 20
np.random.seed(12345)

import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

In [84]:
data = pd.Series(np.random.randn(9),
                index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'], [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    1.669025
   2   -0.438570
   3   -0.539741
b  1    0.476985
   3    3.248944
c  1   -1.021228
   2   -0.577087
d  2    0.124121
   3    0.302614
dtype: float64

In [85]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [87]:
print(data['b'])
print(data['b':'c'])
print(data.loc[['b', 'd']])

1    0.476985
3    3.248944
dtype: float64
b  1    0.476985
   3    3.248944
c  1   -1.021228
   2   -0.577087
dtype: float64
b  1    0.476985
   3    3.248944
d  2    0.124121
   3    0.302614
dtype: float64

In [89]:
data.loc[:, 2]

a   -0.438570
c   -0.577087
d    0.124121
dtype: float64

In [90]:
data.unstack()

          1         2         3
a  1.669025 -0.438570 -0.539741
b  0.476985       NaN  3.248944
c -1.021228 -0.577087       NaN
d       NaN  0.124121  0.302614

In [91]:
data.unstack().stack()

a  1    1.669025
   2   -0.438570
   3   -0.539741
b  1    0.476985
   3    3.248944
c  1   -1.021228
   2   -0.577087
d  2    0.124121
   3    0.302614
dtype: float64

In [92]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                        index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                        columns=[['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [94]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [95]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [96]:
frame.swaplevel('key1', 'key2') #Levels of the indices to be swapped.

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [99]:
print(frame)
print(frame.sort_index(level=1))
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11
state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11